###################################################################

# Created by write_sdc on Thu Sep 15 01:18:46 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_clk]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_rst_n]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_write_enable]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports i_read_enable]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_write_data[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_address[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_address[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_address[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {i_address[0]}]
set_load -pin_load 0.5 [get_ports {o_read_data[31]}]
set_load -pin_load 0.5 [get_ports {o_read_data[30]}]
set_load -pin_load 0.5 [get_ports {o_read_data[29]}]
set_load -pin_load 0.5 [get_ports {o_read_data[28]}]
set_load -pin_load 0.5 [get_ports {o_read_data[27]}]
set_load -pin_load 0.5 [get_ports {o_read_data[26]}]
set_load -pin_load 0.5 [get_ports {o_read_data[25]}]
set_load -pin_load 0.5 [get_ports {o_read_data[24]}]
set_load -pin_load 0.5 [get_ports {o_read_data[23]}]
set_load -pin_load 0.5 [get_ports {o_read_data[22]}]
set_load -pin_load 0.5 [get_ports {o_read_data[21]}]
set_load -pin_load 0.5 [get_ports {o_read_data[20]}]
set_load -pin_load 0.5 [get_ports {o_read_data[19]}]
set_load -pin_load 0.5 [get_ports {o_read_data[18]}]
set_load -pin_load 0.5 [get_ports {o_read_data[17]}]
set_load -pin_load 0.5 [get_ports {o_read_data[16]}]
set_load -pin_load 0.5 [get_ports {o_read_data[15]}]
set_load -pin_load 0.5 [get_ports {o_read_data[14]}]
set_load -pin_load 0.5 [get_ports {o_read_data[13]}]
set_load -pin_load 0.5 [get_ports {o_read_data[12]}]
set_load -pin_load 0.5 [get_ports {o_read_data[11]}]
set_load -pin_load 0.5 [get_ports {o_read_data[10]}]
set_load -pin_load 0.5 [get_ports {o_read_data[9]}]
set_load -pin_load 0.5 [get_ports {o_read_data[8]}]
set_load -pin_load 0.5 [get_ports {o_read_data[7]}]
set_load -pin_load 0.5 [get_ports {o_read_data[6]}]
set_load -pin_load 0.5 [get_ports {o_read_data[5]}]
set_load -pin_load 0.5 [get_ports {o_read_data[4]}]
set_load -pin_load 0.5 [get_ports {o_read_data[3]}]
set_load -pin_load 0.5 [get_ports {o_read_data[2]}]
set_load -pin_load 0.5 [get_ports {o_read_data[1]}]
set_load -pin_load 0.5 [get_ports {o_read_data[0]}]
create_clock [get_ports i_clk]  -name CLK  -period 100  -waveform {0 50}
set_clock_latency 0  [get_clocks CLK]
set_clock_uncertainty -setup 0.2  [get_clocks CLK]
set_clock_uncertainty -hold 0.1  [get_clocks CLK]
set_clock_transition -max -rise 0.05 [get_clocks CLK]
set_clock_transition -min -rise 0.05 [get_clocks CLK]
set_clock_transition -max -fall 0.05 [get_clocks CLK]
set_clock_transition -min -fall 0.05 [get_clocks CLK]
group_path -name INOUT  -from [list [get_ports i_clk] [get_ports i_rst_n] [get_ports i_write_enable] [get_ports i_read_enable] [get_ports {i_write_data[31]}] [get_ports {i_write_data[30]}] [get_ports {i_write_data[29]}] [get_ports {i_write_data[28]}] [get_ports {i_write_data[27]}] [get_ports {i_write_data[26]}] [get_ports {i_write_data[25]}] [get_ports {i_write_data[24]}] [get_ports {i_write_data[23]}] [get_ports {i_write_data[22]}] [get_ports {i_write_data[21]}] [get_ports {i_write_data[20]}] [get_ports {i_write_data[19]}] [get_ports {i_write_data[18]}] [get_ports {i_write_data[17]}] [get_ports {i_write_data[16]}] [get_ports {i_write_data[15]}] [get_ports {i_write_data[14]}] [get_ports {i_write_data[13]}] [get_ports {i_write_data[12]}] [get_ports {i_write_data[11]}] [get_ports {i_write_data[10]}] [get_ports {i_write_data[9]}] [get_ports {i_write_data[8]}] [get_ports {i_write_data[7]}] [get_ports {i_write_data[6]}] [get_ports {i_write_data[5]}] [get_ports {i_write_data[4]}] [get_ports {i_write_data[3]}] [get_ports {i_write_data[2]}] [get_ports {i_write_data[1]}] [get_ports {i_write_data[0]}] [get_ports {i_address[3]}] [get_ports {i_address[2]}] [get_ports {i_address[1]}] [get_ports {i_address[0]}]]  -to [list [get_ports {o_read_data[31]}] [get_ports {o_read_data[30]}] [get_ports {o_read_data[29]}] [get_ports {o_read_data[28]}] [get_ports {o_read_data[27]}] [get_ports {o_read_data[26]}] [get_ports {o_read_data[25]}] [get_ports {o_read_data[24]}] [get_ports {o_read_data[23]}] [get_ports {o_read_data[22]}] [get_ports {o_read_data[21]}] [get_ports {o_read_data[20]}] [get_ports {o_read_data[19]}] [get_ports {o_read_data[18]}] [get_ports {o_read_data[17]}] [get_ports {o_read_data[16]}] [get_ports {o_read_data[15]}] [get_ports {o_read_data[14]}] [get_ports {o_read_data[13]}] [get_ports {o_read_data[12]}] [get_ports {o_read_data[11]}] [get_ports {o_read_data[10]}] [get_ports {o_read_data[9]}] [get_ports {o_read_data[8]}] [get_ports {o_read_data[7]}] [get_ports {o_read_data[6]}] [get_ports {o_read_data[5]}] [get_ports {o_read_data[4]}] [get_ports {o_read_data[3]}] [get_ports {o_read_data[2]}] [get_ports {o_read_data[1]}] [get_ports {o_read_data[0]}]]
group_path -name INREG  -from [list [get_ports i_clk] [get_ports i_rst_n] [get_ports i_write_enable] [get_ports i_read_enable] [get_ports {i_write_data[31]}] [get_ports {i_write_data[30]}] [get_ports {i_write_data[29]}] [get_ports {i_write_data[28]}] [get_ports {i_write_data[27]}] [get_ports {i_write_data[26]}] [get_ports {i_write_data[25]}] [get_ports {i_write_data[24]}] [get_ports {i_write_data[23]}] [get_ports {i_write_data[22]}] [get_ports {i_write_data[21]}] [get_ports {i_write_data[20]}] [get_ports {i_write_data[19]}] [get_ports {i_write_data[18]}] [get_ports {i_write_data[17]}] [get_ports {i_write_data[16]}] [get_ports {i_write_data[15]}] [get_ports {i_write_data[14]}] [get_ports {i_write_data[13]}] [get_ports {i_write_data[12]}] [get_ports {i_write_data[11]}] [get_ports {i_write_data[10]}] [get_ports {i_write_data[9]}] [get_ports {i_write_data[8]}] [get_ports {i_write_data[7]}] [get_ports {i_write_data[6]}] [get_ports {i_write_data[5]}] [get_ports {i_write_data[4]}] [get_ports {i_write_data[3]}] [get_ports {i_write_data[2]}] [get_ports {i_write_data[1]}] [get_ports {i_write_data[0]}] [get_ports {i_address[3]}] [get_ports {i_address[2]}] [get_ports {i_address[1]}] [get_ports {i_address[0]}]]
group_path -name REGOUT  -to [list [get_ports {o_read_data[31]}] [get_ports {o_read_data[30]}] [get_ports {o_read_data[29]}] [get_ports {o_read_data[28]}] [get_ports {o_read_data[27]}] [get_ports {o_read_data[26]}] [get_ports {o_read_data[25]}] [get_ports {o_read_data[24]}] [get_ports {o_read_data[23]}] [get_ports {o_read_data[22]}] [get_ports {o_read_data[21]}] [get_ports {o_read_data[20]}] [get_ports {o_read_data[19]}] [get_ports {o_read_data[18]}] [get_ports {o_read_data[17]}] [get_ports {o_read_data[16]}] [get_ports {o_read_data[15]}] [get_ports {o_read_data[14]}] [get_ports {o_read_data[13]}] [get_ports {o_read_data[12]}] [get_ports {o_read_data[11]}] [get_ports {o_read_data[10]}] [get_ports {o_read_data[9]}] [get_ports {o_read_data[8]}] [get_ports {o_read_data[7]}] [get_ports {o_read_data[6]}] [get_ports {o_read_data[5]}] [get_ports {o_read_data[4]}] [get_ports {o_read_data[3]}] [get_ports {o_read_data[2]}] [get_ports {o_read_data[1]}] [get_ports {o_read_data[0]}]]
set_input_delay -clock CLK  40  [get_ports i_clk]
set_input_delay -clock CLK  40  [get_ports i_rst_n]
set_input_delay -clock CLK  40  [get_ports i_write_enable]
set_input_delay -clock CLK  40  [get_ports i_read_enable]
set_input_delay -clock CLK  40  [get_ports {i_write_data[31]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[30]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[29]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[28]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[27]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[26]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[25]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[24]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[23]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[22]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[21]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[20]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[19]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[18]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[17]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[16]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[15]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[14]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[13]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[12]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[11]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[10]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[9]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[8]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[7]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[6]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[5]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[4]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[3]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[2]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[1]}]
set_input_delay -clock CLK  40  [get_ports {i_write_data[0]}]
set_input_delay -clock CLK  20  [get_ports {i_address[3]}]
set_input_delay -clock CLK  20  [get_ports {i_address[2]}]
set_input_delay -clock CLK  20  [get_ports {i_address[1]}]
set_input_delay -clock CLK  20  [get_ports {i_address[0]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[31]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[30]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[29]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[28]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[27]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[26]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[25]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[24]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[23]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[22]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[21]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[20]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[19]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[18]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[17]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[16]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[15]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[14]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[13]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[12]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[11]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[10]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[9]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[8]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[7]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[6]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[5]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[4]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[3]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[2]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[1]}]
set_output_delay -clock CLK  20  [get_ports {o_read_data[0]}]
